//封面图组件
const gate = {
    template: '#gateCpn',
    data() {
        return {
            gatelStyle: {
                transform: "rotateY(90deg)",
                opacity: '0'
            },
            gaterStyle: {
                transform: "rotateY(-90deg)",
                opacity: '0'
            },
            isClick: false
        }
    },
    methods: {
        click() {
            this.isClick = true;
            this.$parent.homeShow = true;
            this.$refs.go.style.display = "none";
            setTimeout(() => this.$parent.gateShow = false, 5000);
        }
    }
}

//左边栏视图组件
const hwAside = { template: `<h1 class="hwAside"></h1>` }
const paintAside = { template: `<h1 class="paintAside"></h1>` }
const poetryAside = { template: `<h1 class="poetryAside"></h1>` }
const fsAside = { template: `<h1 class="fsAside"></h1>` }

//主内容视图组件
const hwContainer = {
    template: '#containerCpn',
    data() {
        return {
            summary: '汉字书法在中国五千年璀璨的文明及无与伦比的丰富文字记载都已为世人所认可，在这一博大精深的历史长河中，中国的书画艺术以其独特的艺术形式和艺术语言再现了这一历时性的嬗变过程。而具有姊妹性质的书画艺术在历史的嬗变中，又以其互补性和独立性释读了中国传统文化内涵。'
        }
    }
}
const paintContainer = {
    template: '#containerCpn',
    data() {
        return {
            summary: '中国画，简称“国画”。国画是汉族的传统绘画形式，是用毛笔蘸水、墨、彩作画于绢或纸上。工具和材料有毛笔、墨、国画颜料、宣纸、绢等，题材可分人物、山水、花鸟。从美术史的角度讲，民国前的都统称为古画。国画在古代无确定名称，一般称之为丹青，在世界美术领域中自成体系。'
        }
    }
}
const poetryContainer = {
    template: '#containerCpn',
    data() {
        return {
            summary: '诗词曲赋，所谓诗词曲赋，是人们对我国传统汉文学的概称；这一称谓几乎可说是也已概括了中国传统文化的精髓和文化尤其是传统文学的大成。诗词是阐述心灵的文学艺术，而诗人、词人则需要掌握成熟的艺术技巧，并按照严格韵律要求，用凝练的语言、充沛的情感来高度集中地表现社会生活和人类精神世界。'
        }
    }
}
const fsContainer = {
    template: '#containerCpn',
    data() {
        return {
            summary: '中国最重要的传统节日有春节、元宵节、端午节、中秋节、重阳节等。另外还有24节气当中也分别对应了不同的传统节日，是自然节气点，也是传统的节日，同时中国少数民族也都保留着自己的传统的节日，比如傣族的泼水节，蒙古族的那达慕大会、彝族的火把节等等。'
        }
    }
}

//书法子内容视图组件
const hwAndPMixin = {
    data() {
        return {
            bigExhibi: {
                imgSrc: '',
                desc: ''
            },
            bigShow: false
        }
    },
    methods: {
        exhibiClick(item) {
            // console.log(item);
            this.bigShow = true;
            this.bigExhibi.imgSrc = item.imgSrc;
            this.bigExhibi.desc = item.detail;
        }
    }
}
const zhuan = {
    template: '#subContainerCpn',
    mixins: [hwAndPMixin],
    data() {
        return {
            subImgSrc: './img/handwrite/zhuan/subImg.png',
            subSum: '篆书,是甲骨文、大篆、小篆的统称,是一种呈现曲直相映乐趣的文字。广义的篆书，包括甲古文及金文，此处的篆书特别只大篆及小篆。[大篆]指金文、籀文、六国文字，它们保存着古代象形文字的明显特点;[小篆]也称“秦篆”，是秦国的通用文字，由李斯整理出来的。篆书,笔法瘦劲挺拔，直线较多。起笔有方笔、圆笔，也有尖笔，手笔“悬针”较多。大篆的简化字体，其特点是形体匀逼齐整、字体较籀文容易书写。',
            exhibitions: [
                { imgSrc: './img/handwrite/zhuan/1.jpeg', desc: '毛公鼎', detail: '毛公鼎，西周晚期毛公所铸青铜器，清道光末年出土于陕西岐山（今宝鸡市岐山县），收藏于台北故宫博物院。毛公鼎内铭文长达四百九十七字，记载了毛公衷心向周宣王为国献策之事，被誉为“抵得一篇尚书”。其书法乃成熟的西周金文风格，奇逸飞动，气象浑穆，笔意圆劲茂隽，结体方长。是研究西周晚年政治史的重要史料。' },
                { imgSrc: './img/handwrite/zhuan/2.jpeg', desc: '散氏盘', detail: '散氏盘，因铭文中有“散氏”字样而得名。有人认为作器者为夨，又称作夨人盘。传清乾隆初年于陕西凤翔出土。1935年《散氏盘》随清宫其它文物移交北平故宫博物院，抗战时曾南迁，现藏于台北故宫博物院。散氏盘，其铭文结构奇古，线条圆润而凝炼，字迹草率字形扁平，体势欹侧，显得奇古生动，已开“草篆”之端。因取横势而重心偏低，故愈显朴厚。其“浇铸”感很强烈，表现了浓重的“金味”，因此在碑学体系中，占有重要的位置。' },
                { imgSrc: './img/handwrite/zhuan/3.jpeg', desc: '虢季子白盘', detail: '虢季子白盘，商周时期盛水器，晚清时期出土于宝鸡，现收藏于中国国家博物馆，是镇馆之宝。虢季子白盘被视为西周金文中的绝品。它的金文排列方式与字形处理方式显然有别于其他西周铭文，却与东周后期战国吴楚文存在着某种相近的格局。比如，它非常注意每一文字的单独性。线条讲究清丽流畅的感觉，而字形却注重疏密避让的追求，有些钱条刻意拉长，造成动荡的空间效果。造型的精练与细密，也使大家惊讶于西周金文中这样清丽秀逸的格调。' },
                { imgSrc: './img/handwrite/zhuan/4.jpeg', desc: '石鼓文', detail: '石鼓文，秦刻石文字，因其刻石外形似鼓而得名。发现于唐初，共十枚，高约二尺，径约三尺，分别刻有大篆四言诗一首，共十首，计七百一十八字。石鼓文是集大篆之成，开小篆之先河，在书法史上起着承前启后的作用。是由大篆向小篆衍变而又尚未定型的过渡性字体。石鼓文被历代书家视为习篆书的重要范本，故有“书家第一法则”之称誉。' },
                { imgSrc: './img/handwrite/zhuan/5.jpeg', desc: '峄山刻石', detail: '峄山刻石又称元摹峄山秦篆碑。原立于邹县城县衙大堂，民国初年移入孟庙致敬门内，1973年移入启圣殿内保存，现存于邹城市博物馆。从《峄山石刻》可以看出，李斯的书法运笔坚劲畅达，线条圆润，结构匀称，点画粗细均匀，既具图案之美，又有飞翔灵动之势。书法造诣之高超掩灭先轨，散绝后贤，使一切写小篆的人皆难入其境，成为后世临摹学书之佳。' },
                { imgSrc: './img/handwrite/zhuan/6.jpeg', desc: '袁安碑', detail: '称“汉司徒袁安碑”。东汉永元四年(公元92)立。原石出土地点不详，1929年在河南偃师县城南辛家村发现，现藏河南博物院。由于该碑发现较晚，字口锋颖如新，书法浑厚古茂，雄朴多姿，线条纤细婉转，体态遒劲流畅，飘逸圆融中尽显端庄方正，是汉代篆书的典型代表。现代书家费声骞评《袁安碑》：“此碑笔画瘦劲，纤而能厚，结体宽博，运笔圆匀，碑字清晰，可供学篆取法善本。”' },
                { imgSrc: './img/handwrite/zhuan/7.jpeg', desc: '天发神谶碑', detail: '《天发神谶碑》又称《吴天玺记功颂》，三国吴天玺元年(267)刻。吴的最后一位君主孙皓，因天降符瑞而立碑记功。此碑书法若篆若隶，在节史上最为奇特。方朔《枕经堂金石书画题跋》曰：“予观其书，方折盘旋以隶笔而行篆体，戈长剑利中实乃弓燥手柔。张怀雳以沉着痛快目之，良下虚也。”' },
                { imgSrc: './img/handwrite/zhuan/8.jpeg', desc: '李阳冰篆书', detail: '李阳冰（生卒年不详），约生于唐玄宗开元年间。他的篆书,“劲利豪爽，风行而集，识者谓之苍颉后身。”甚至被后人称为“李斯之后的千古一人”。在唐代篆书中，李阳冰是成就最高的。谓之“铁线描。”《三坟记碑》承李斯《峄山碑》玉筋笔法，以瘦劲取胜，结体修长，线条遒劲平整，笔画从头至尾粗细一致，光滑洁净，婉曲翩然。' },
                { imgSrc: './img/handwrite/zhuan/9.jpeg', desc: '邓石如篆书', detail: '邓石如（1739或1743—1805，），清代大书法家。其篆书以《石鼓文》、《泰山刻石》、《峄山碑》、《开母石阙》为法，并融合汉碑额婉转飘动的意趣，字形方圆互用，姿态新颖，笔力深雄，婀娜多姿，体势大度，用笔灵活而富于变化，骨力坚韧，一扫当时呆板纤弱、单调雷同的积习。又篆从隶入，隶从篆出，自成一家风范。' },
                { imgSrc: './img/handwrite/zhuan/10.jpeg', desc: '吴昌硕篆书', detail: '吴昌硕（1844.8.1 —1927.11.29），男，原名俊，字昌硕，别号缶庐、苦铁等，汉族，浙江安吉人。其书法尤以篆书最为“名世绝品”。他经过数十年的强抱《石鼓》，不拘成法，弃形取神，独树一帜，创出了一条全新的路子，使《石鼓文》书法走入了空前绝后的境地。提及吴昌硕的篆书，人们必然会想到《石鼓文》，而一谈到《石鼓文》，便不禁联想起吴昌硕，两者结合得如此紧密，纵观书法史，恐难找出第二。' }
            ],
            ehbtTitle: '篆书十大经典作品欣赏'
        }
    }
}
const li = {
    template: '#subContainerCpn',
    mixins: [hwAndPMixin],
    data() {
        return {
            subImgSrc: './img/handwrite/li/subImg.png',
            subSum: '隶书，亦称汉隶，是汉字中常见的一种庄重的字体，书写效果略微宽扁，横画长而直画短，呈长方形状，讲究“蚕头雁尾”、“一波三折”。是为了因应日益繁复的文书处理,秦狱吏程邈作出了这种方广字体，改变了篆书的结构，强调横平竖直、间架紧密。隶书写起来比篆书方便很多，为后代子孙节省了许多宝贵的时间，在学术上亦具有极大的价值。隶书起源于秦朝，在东汉时期达到顶峰，对后世书法有不可小觑的影响，书法界有"汉隶唐楷"之称。',
            exhibitions: [
                { imgSrc: './img/handwrite/li/1.jpeg', desc: '蔡邕书', detail: '蔡邕 （133-192），字伯喈，陈留郡圉县(今河南省开封市圉镇)人，东汉时期著名文学家和书法家，其始创“飞白”书体，对后世书法艺术产生重大的影响。蔡邕是著名才女蔡文姬的父亲，精通音律、经史、辞赋、书法，多才多艺。其擅长篆、隶书，尤以隶书造诣最为高深，有“蔡邕书骨气洞达，爽爽有神力”的美誉，传世的隶书作品有《熹平石经》。' },
                { imgSrc: './img/handwrite/li/2.jpeg', desc: '蔡邕书', detail: '蔡邕 （133-192），字伯喈，陈留郡圉县(今河南省开封市圉镇)人，东汉时期著名文学家和书法家，其始创“飞白”书体，对后世书法艺术产生重大的影响。蔡邕是著名才女蔡文姬的父亲，精通音律、经史、辞赋、书法，多才多艺。其擅长篆、隶书，尤以隶书造诣最为高深，有“蔡邕书骨气洞达，爽爽有神力”的美誉，传世的隶书作品有《熹平石经》。' },
                { imgSrc: './img/handwrite/li/3.jpeg', desc: '蔡邕书', detail: '蔡邕 （133-192），字伯喈，陈留郡圉县(今河南省开封市圉镇)人，东汉时期著名文学家和书法家，其始创“飞白”书体，对后世书法艺术产生重大的影响。蔡邕是著名才女蔡文姬的父亲，精通音律、经史、辞赋、书法，多才多艺。其擅长篆、隶书，尤以隶书造诣最为高深，有“蔡邕书骨气洞达，爽爽有神力”的美誉，传世的隶书作品有《熹平石经》。' },
                { imgSrc: './img/handwrite/li/4.jpeg', desc: '郭香察书', detail: '郭香察（生卒不详），东汉人，无法查阅到具体资料。因《西岳华山庙碑》署有“遣书郎书佐新丰郭香察书”等字句，所以大部分专家学者认为此碑为郭香察所书，也有人认为是蔡邕所作，存在较大的争议。' },
                { imgSrc: './img/handwrite/li/5.jpeg', desc: '郭香察书', detail: '郭香察（生卒不详），东汉人，无法查阅到具体资料。因《西岳华山庙碑》署有“遣书郎书佐新丰郭香察书”等字句，所以大部分专家学者认为此碑为郭香察所书，也有人认为是蔡邕所作，存在较大的争议。' },
                { imgSrc: './img/handwrite/li/6.jpeg', desc: '钟繇书', detail: '钟繇（151-230），字元常，河南长葛（今为许昌市管辖的长葛市）人。钟繇精通隶书、章草、楷书等书体，其中最擅楷书。在中国书法发展史上，钟繇为隶书向楷书演变过程中一个标志性、最具影响力人物，是中国书法史上第一个创写楷书并取得大成的书法名家，被后人誉为“正书之祖”。钟繇代表作有《宣示表》、《贺捷表》、《荐季直表》等，《公卿将军上尊号奏碑》传为其的隶书作品。' },
                { imgSrc: './img/handwrite/li/7.jpeg', desc: '钟繇书', detail: '钟繇（151-230），字元常，河南长葛（今为许昌市管辖的长葛市）人。钟繇精通隶书、章草、楷书等书体，其中最擅楷书。在中国书法发展史上，钟繇为隶书向楷书演变过程中一个标志性、最具影响力人物，是中国书法史上第一个创写楷书并取得大成的书法名家，被后人誉为“正书之祖”。钟繇代表作有《宣示表》、《贺捷表》、《荐季直表》等，《公卿将军上尊号奏碑》传为其的隶书作品。' },
                { imgSrc: './img/handwrite/li/8.jpeg', desc: '曹操书', detail: '曹操（155-220），字孟德，沛国谯县（今安徽亳州）人，东汉末年杰出的政治家、军事家、文学家、书法家，三国曹魏政权的奠基人。曹操文学造诣深厚，文学成就突出，留世的诗歌有20多首，其中《观沧海》、《蒿里行》、《度关山》、《对酒》、《短歌行》为其代表作。曹操擅长书法，尤工章草，书法造诣高深，西晋文学家张华在《博物志》中称：“汉世，安平崔瑗、瑗子寔、弘农张芝、芝弟昶并善草书，而太祖亚之”（太祖指的就是曹操）。曹操传世隶书作品有《衮雪》石刻。' },
                { imgSrc: './img/handwrite/li/9.jpeg', desc: '唐玄宗李隆基书', detail: '唐玄宗李隆基（685-762），公元712年至756年在皇位。任政治初期励精图治，开创唐朝“开元盛世”，后期怠慢朝政、宠信奸臣，导致发生“安史之乱”。唐玄宗多才多艺，擅长音律和书法，是中国书法史上著名的帝王书家之一，其传世的书法作品有《鹡鸰颂》《纪泰山铭》《石台孝经》等多件，其中《石台孝经》为隶书作品。' },
                { imgSrc: './img/handwrite/li/10.jpeg', desc: '史惟则书', detail: '史惟则（生卒年不详），江苏扬州人，唐朝著名书法家，与韩择木、蔡有邻、李潮4人合称唐代隶书四大家，传世隶书作品有《大智禅师碑》。' },
                { imgSrc: './img/handwrite/li/11.jpeg', desc: '米芾书', detail: '米芾(1051-1107)，初名黻，后改芾，字元章，自署姓名米或为芊，湖北襄阳人，北宋书法家、画家、书画理论家，与蔡襄、苏轼、黄庭坚合称“宋四家”。米芾书法造诣高深，擅篆、隶、楷、行、草等书体， 主要作品有《宝晋英光集》、《宝章待访录》、《书史》《画史》、《砚史》等，传世隶书作品有《绍兴米帖》' },
                { imgSrc: './img/handwrite/li/12.jpeg', desc: '赵孟书', detail: '赵孟（1254 -1322），字子昂，汉族，号松雪道人 ，又号水晶宫道人、鸥波。浙江吴兴(今浙江湖州)人。元代著名书法家、画家、诗人。赵孟博学多才，能诗善文，懂经济，工书法，精绘艺，擅金石，通律率，解鉴赏。特别是书法和绘画成就最高，开创元代新画风，被称为“元人冠冕”。他善篆、隶、真、行、草书，尤以楷、行书著称于世。其书风遒媚、秀逸，结体严整、笔法圆熟，创“赵体”书，与欧阳询、颜真卿、柳公权并称“楷书四大家”。传世隶书作品有《隶书千字文》。' },
                { imgSrc: './img/handwrite/li/13.jpeg', desc: '吴志淳书', detail: '吴志淳（生卒年不详），字主一，元代无为州（今安徽无为县）人，其能诗善书，工草篆隶三体，传世隶书作品有《广琴操》。' },
                { imgSrc: './img/handwrite/li/14.jpeg', desc: '沈度书', detail: '沈度（1357-1434），字民则，号自乐，明松江府华亭(今上海金山)人，明代著名书法家，翰林院侍讲学士。其被后世称为“馆阁体之祖师”，明成祖朱棣赞其为“我朝王羲之”。沈度擅篆、隶、楷、行等书体，传世隶书作品为有《归去来辞》。' },
                { imgSrc: './img/handwrite/li/15.jpeg', desc: '杨士奇书', detail: '杨士奇（1366-1444），名寓，字士奇，号东里，江西泰和人，明代大臣、学者，官至内阁首辅、兵部尚书，传世隶书作品有《杏园雅集序》' },
            ],
            ehbtTitle: '隶书作品展'
        }
    }
}
const kai = {
    template: '#subContainerCpn',
    mixins: [hwAndPMixin],
    data() {
        return {
            subImgSrc: './img/handwrite/kai/subImg.png',
            subSum: '楷书，也叫正楷、真书、正书。由隶书逐渐演变而来，更趋简化，横平竖直,是在汉朝时以隶书字体作楷法加以改进的书体，今人称之为正楷。由於楷书写起来又比隶书方便，因此汉朝人民都采用它以适应实际生活的需要;楷书至唐代大盛，书家如颜真卿，以雄健恢弘的气势独树一格，影响后世甚钜。楷书,《辞海》解释说它“形体方正，笔画平直，可作楷模”,这种汉字字体，就是现在通行的汉字手写正体字。',
            exhibitions: [
                { imgSrc: './img/handwrite/kai/1.jpg', desc: '钟繇书', detail: '钟繇，字元常，颍川长社人，生于151年，太和四年（230年），钟繇去世，年八十。钟繇生于汉末名士之家，官至太傅，三国时期曹魏著名书法家、政治家，谥号“成”。钟繇擅篆、隶、真、行、草多种书体，在书法方面颇有造诣，推动了楷书（小楷）的发展，被后世尊为“楷书鼻祖”。' },
                { imgSrc: './img/handwrite/kai/2.jpg', desc: '钟繇书', detail: '钟繇，字元常，颍川长社人，生于151年，太和四年（230年），钟繇去世，年八十。钟繇生于汉末名士之家，官至太傅，三国时期曹魏著名书法家、政治家，谥号“成”。钟繇擅篆、隶、真、行、草多种书体，在书法方面颇有造诣，推动了楷书（小楷）的发展，被后世尊为“楷书鼻祖”。' },
                { imgSrc: './img/handwrite/kai/3.jpg', desc: '王羲之书', detail: '王羲之（303年—361年），字逸少，琅琊临沂人，东晋时期著名书法家。王羲之官至会稽内史，领右将军，世称王右军。王羲之书法兼善隶、草、楷、行各体，精研体势，广采众长，冶于一炉，自成一家，对我国书法文化有着深远的影响。代表作《兰亭序》被誉为“天下第一行书”' },
                { imgSrc: './img/handwrite/kai/4.jpg', desc: '王羲之书', detail: '王羲之（303年—361年），字逸少，琅琊临沂人，东晋时期著名书法家。王羲之官至会稽内史，领右将军，世称王右军。王羲之书法兼善隶、草、楷、行各体，精研体势，广采众长，冶于一炉，自成一家，对我国书法文化有着深远的影响。代表作《兰亭序》被誉为“天下第一行书”' },
                { imgSrc: './img/handwrite/kai/5.jpg', desc: '虞世南书', detail: '虞世南（558年－638年），字伯施，越州余姚人。南北朝至隋唐时著名书法家、文学家、诗人、政治家，凌烟阁二十四功臣之一。唐太宗称他德行、忠直、博学、文词、书翰为五绝。虞世南善书法，与欧阳询、褚遂良、薛稷合称“初唐四大家”。' },
                { imgSrc: './img/handwrite/kai/6.jpg', desc: '虞世南书', detail: '虞世南（558年－638年），字伯施，越州余姚人。南北朝至隋唐时著名书法家、文学家、诗人、政治家，凌烟阁二十四功臣之一。唐太宗称他德行、忠直、博学、文词、书翰为五绝。虞世南善书法，与欧阳询、褚遂良、薛稷合称“初唐四大家”。' },
                { imgSrc: './img/handwrite/kai/7.jpg', desc: '米芾书', detail: '米芾（1051—1107），字元章，湖北襄阳人。 北宋书法家、画家、书画理论家，与蔡襄、苏轼、黄庭坚合称“宋四家”。米芾能诗文，擅书画，书画自成一家，创立了“米点山水”。 主要作品有《多景楼诗》《虹县诗》《拜中岳命帖》等。' },
                { imgSrc: './img/handwrite/kai/8.jpg', desc: '米芾书', detail: '米芾（1051—1107），字元章，湖北襄阳人。 北宋书法家、画家、书画理论家，与蔡襄、苏轼、黄庭坚合称“宋四家”。米芾能诗文，擅书画，书画自成一家，创立了“米点山水”。 主要作品有《多景楼诗》《虹县诗》《拜中岳命帖》等。' },
                { imgSrc: './img/handwrite/kai/9.jpg', desc: '赵孟頫', detail: '赵孟頫（1254年 —1322年）字子昂，号松雪道人，元代著名书画家。赵孟頫博学多才，尤其以书法和绘画成就最高。赵孟頫亦善篆、隶、真、行、草书，尤以楷、行书著称于世与欧阳询、颜真卿、柳公权并称“楷书四大家”。他的小楷《道德经》《汲黯传》，恬静秀丽，是学习小楷的好范本。' },
                { imgSrc: './img/handwrite/kai/10.jpg', desc: '赵孟頫', detail: '赵孟頫（1254年 —1322年）字子昂，号松雪道人，元代著名书画家。赵孟頫博学多才，尤其以书法和绘画成就最高。赵孟頫亦善篆、隶、真、行、草书，尤以楷、行书著称于世与欧阳询、颜真卿、柳公权并称“楷书四大家”。他的小楷《道德经》《汲黯传》，恬静秀丽，是学习小楷的好范本。' },
            ],
            ehbtTitle: '楷书作品展'
        }
    }
}
const xing = {
    template: '#subContainerCpn',
    mixins: [hwAndPMixin],
    data() {
        return {
            subImgSrc: './img/handwrite/xing/subImg.png',
            subSum: '行书，是在隶书的基础上发展起源的，介于楷书、草书之间的一种字体，是为了弥补楷书的书写速度太慢和草书的难于辨认而产生的。行书,方不如隶书，圆不如篆书，换言之就是楷书的变体，因写起来像人行路，故称行书。一般认为行书起於东汉刘德升，至魏初钟繇稍变其异，二王造其极，行书乃大行於世。行书写起来十分方便，能达到赴速应急的目的。历代有名的行书作品多如天上的星星，而尤以东晋王羲之的[兰亭序]为第一书迹。行书的实质,是楷书的草化或草书的楷化。楷法多于草法的叫“行楷”，草法多于楷法的叫“行草”。',
            exhibitions: [
                { imgSrc: './img/handwrite/xing/1.jpeg', desc: '王羲之《兰亭序》', detail: '公元353年4月22日（东晋永和九年三月初三，距今已经1666年），王羲之与好友谢安等41人在会稽的山阴兰亭集会，大家坐在小溪旁边，装满绍兴黄酒的的小碗停在谁的身前谁就要饮酒作诗。王羲之在微醉之时，如有神助，一气呵成，写下了这篇天下第一行书《兰亭序》，犹如一盏明灯，照亮了魏晋以来书法的发展方向。《兰亭序》真迹已经陪葬在唐太宗的昭陵里了，现在大家看到的是唐冯承素的摹本，此本给人一种“不激不厉而风规自远”的感觉，最能体现王羲之原作的神韵。' },
                { imgSrc: './img/handwrite/xing/2.jpeg', desc: '颜真卿《祭侄文稿》', detail: '这篇书法是颜真卿追祭从侄颜季明而作。唐玄宗末年，安禄山发动叛乱，颜季明在平叛战争中被杀。公元758年（唐肃宗乾元元年），颜真卿派人搜寻到了侄子颜季明的首骨，做下了这篇流芳千古的祭文。他在极度悲伤的心情下迅笔疾书，中途又涂涂改改，就像泪水一串一串流下，写到激动处，又像火山爆发，再也无法控制自己的感情，把自己对侄子的思念以及对叛军的激愤挥洒的淋漓尽致！现在，《祭侄文稿》收藏于台北故宫博物院，不定时的会展出，大家有机会可以去看看颜真卿这篇天下第二行书的风采。' },
                { imgSrc: './img/handwrite/xing/3.jpeg', desc: '苏轼《黄州寒食帖》', detail: '1082年（宋神宗元丰五年），苏轼因宋朝最大的文字狱“乌台诗案”被贬黄州，穷苦潦倒，所以写下了此贴，发出人生之叹。全帖如滔滔江水，激扬澎湃，给人以气势如虹的感觉。寒食帖曾经流落日本，经历了日本关东大地震，辛而无恙。第二次世界大战一结束，国人用重金从日本购回，现藏于台北故宫博物院。' },
                { imgSrc: './img/handwrite/xing/4.jpeg', desc: '王珣《伯远帖》', detail: '清乾隆于1746年获得此帖，与王羲之的《快雪时晴帖》、王献之《中秋帖》合称“三希”，意思是三件希世之宝，并建“三希堂”藏之。《伯远帖》行笔自然流畅，俊丽秀雅，为早期行书的典范。《伯远帖》是公认的东晋时期书法家唯一的真迹，我辈真是有眼福哦，有很多东西只有看真迹才能理解古人的用笔和意境。想看的话可以去北京故宫博物院看。' },
                { imgSrc: './img/handwrite/xing/5.jpg', desc: '国宾礼书法家观山行书书法作品《诫子书》', detail: '古诗词在行书书法创作中属于比较经典的题材，尤其是诸葛亮《诫子书》，被后世视为修身励志的名篇佳作，非常适合挂在家里客厅、书房等场合。' },
                { imgSrc: './img/handwrite/xing/6.jpg', desc: '国宾礼书法家观山行书书法作品《沁园春雪》', detail: '此幅沁园春雪书法便是以毛主席诗词为题材创作而成，诗词本身大气豪放，书法家写作水平更是颇具气势，两者相得益彰。' },
                { imgSrc: './img/handwrite/xing/7.jpg', desc: '国宾礼书法家观山行书作品《天道酬勤》', detail: '天道酬勤是家喻户晓的励志成语，古往今来，人们以它作为精神食粮，在充满挑战的人生道路上砥砺前行。所以，在行书书法欣赏的时候，经常会看到天道酬勤这四个字，或许是书法家想通过这四个字来告诫我们要重天道，知勤奋，也或许是书法家想以此来自我勉励......' },
                { imgSrc: './img/handwrite/xing/8.jpg', desc: '国宾礼书法家观山行书作品《室雅兰香》', detail: '行书书法欣赏，欣赏的不仅是书法家所写的字，更是字背后的意蕴，这也是为什么大家选择书法作为家居办公装饰的原因。一幅好的书法作品不仅能在视觉上给人带来享受，在内容上更能给我们带来精神上的愉悦。此幅室雅兰香书法便是最佳的客厅装饰。' },
            ],
            ehbtTitle: '行书作品展'
        }
    }
}
const cao = {
    template: '#subContainerCpn',
    mixins: [hwAndPMixin],
    data() {
        return {
            subImgSrc: './img/handwrite/cao/subImg.png',
            subSum: '草书,形成于汉代，是为了书写简便在隶书基础上演变出来的。有草篆、草隶、狂草等，草书结构省简、笔划纠连，书写流畅迅速，不易识别。在五种书体中，草书是最具抽象艺术特质的,有“书已尽而意不止、笔虽停而势不穷”之妙。历代能草书者，如东晋王献之、唐代怀素以及近代的于右任等，均能乱中有绪，独树一格,在狂乱中觉得优美。',
            exhibitions: [
                { imgSrc: './img/handwrite/cao/1.jpg', desc: '王羲之《远宦帖》', detail: '王羲之（303—361），汉族，字逸少，东晋书法家，有“书圣”之称。琅琊临沂（今山东临沂）人，后迁会稽山阴（今浙江绍兴），晚年隐居剡县金庭。其书法兼善隶、草、楷、行各体，精研体势，心摹手追，广采众长，备精诸体，冶于一炉，摆脱了汉魏笔风，自成一家，影响深远。风格平和自然，笔势委婉含蓄，遒美健秀。' },
                { imgSrc: './img/handwrite/cao/2.jpg', desc: '王献之《中秋帖》', detail: '王献之（344－386），汉族，字子敬，东晋书法家，有“小圣”之称祖籍琅玡临沂（今山东省临沂市兰山区），生于会稽山阴（今浙江省绍兴市）。“书圣”王羲之第七子、晋简文帝司马昱之婿。王献之少负盛名，才华过人。历任州主簿、秘书郎、司徒长史、吴兴太守、中书令等职。王献之自幼随父练习书法，以行书及草书闻名，但是在楷书和隶书上亦有深厚功底。王献之一生的书法艺术并不守旧，且与父不同，字身喜带长形。他笔下的草书，下笔熟练、润秀、飞舞风流，不亚于父亲王羲之，父子合称二王。还与张芝、钟繇、王羲之并称“书中四贤”。' },
                { imgSrc: './img/handwrite/cao/3.jpg', desc: '张芝《冠军贴》', detail: '张芝，生年不详，约卒于汉献帝初平三年（约公元192年），瓜州县渊泉镇（今甘肃酒泉市瓜州县四道沟老城一带）人，字伯英。勤学好古，淡于仕进。朝廷以有道征不就，时人尊称自为“张有道”。善章草，后脱去旧习，省减章草点画、波桀，成为“今草”，“书圣”王羲之最推崇的前辈书家有两个：一个是曹魏的钟繇，一人是东汉的张芝。他说：“吾书比之钟、张，钟当抗行，或谓过之；张草犹当雁行。然张精熟，池水尽墨，假令余耽之若此，未必谢之。”（见孙过庭《书谱》）“耽”，是沉迷，特别爱好的意思。连王羲之都自叹弗如，可见张芝对书法的热爱程度。' },
                { imgSrc: './img/handwrite/cao/4.jpg', desc: '孙过庭《书谱》', detail: '孙过庭（646～691），名虔礼，以字行。杭州富阳（今属浙江）人，一作陈留（今河南开封）人。唐代书法家、书法理论家。著《书谱》2卷，已佚。今存《书谱序》，分溯源流、辨书体、评名迹、述笔法、诫学者、伤知音6部分，文思缜密，言简意深，在古代书法理论史上占有重要地位。其中许多论点，如学书三阶段、创作中的五乖五合等，至今仍有意义。孙过庭“好古博雅，工文辞，得名于翰墨间”。他擅长楷、行、草诸体，尤以草书著名。孙过庭传世书迹有三种，都是草书墨迹，其中成就最高、影响最大的要数《书谱》。' },
                { imgSrc: './img/handwrite/cao/5.jpg', desc: '张旭作品', detail: '张旭（685—759），字伯高，一字季明，苏州吴县（今江苏苏州）人，唐代书法家，擅长草书，喜欢饮酒，世称“张颠”，与怀素并称“颠张醉素”，与贺知章、张若虚、包融并称“吴中四士”，又与贺知章等人并称“饮中八仙”，其草书则与李白的诗歌、裴旻的剑舞并称“三绝”。在书法方面，张旭勤于观察客观事物，善于将客观的自然物象与个人的主观情感结合起来，既继承传统，又勇于创新，在继承前人书法成就并加以创新而使得自身的狂草艺术在盛唐时期达到了一个高峰。' },
                { imgSrc: './img/handwrite/cao/6.jpg', desc: '怀素作品', detail: '怀素（737-799），俗姓钱，字藏真，永州零陵（今湖南零陵）人。唐代书法家，以“狂草”名世，史称“草圣”。自幼出家为僧，经禅之暇，爱好书法，与张旭齐名，合称“颠张狂素”，形成唐代书法双峰并峙的局面，也是中国草书史上两座高峰。怀素草书，笔法瘦劲，飞动自然，如骤雨旋风，随手万变。书法率意颠逸，千变万化，法度具备。北京大学教授、引碑入草开创者的李志敏评价：“怀素的草书奔逸中有清秀之神，狂放中有淳穆之气”。' },
                { imgSrc: './img/handwrite/cao/7.jpg', desc: '黄庭坚《洛阳雨霁诗》', detail: '黄庭坚（1045—1105），字鲁直，号山谷道人，晚号涪翁，洪州分宁（今江西省九江市修水县）人，北宋著名文学家、书法家、盛极一时的江西诗派开山之祖，与杜甫、陈师道和陈与义素有“一祖三宗”（黄庭坚为其中一宗）之称。与张耒、晁补之、秦观都游学于苏轼门下，合称为“苏门四学士”。生前与苏轼齐名，世称“苏黄”。著有《山谷词》，且黄庭坚书法亦能独树一格，为“宋四家”之一。黄庭坚的草书是学时人周越的。苏轼以周越书为“险劣”，米芾则评周越书为“气势雄健而锋刃交加”。' },
                { imgSrc: './img/handwrite/cao/8.jpg', desc: '米芾《论草书帖》', detail: '米芾（1051—1107），初名黻，后改芾，字元章，自署姓名米或为芊，湖北襄阳人，时人号海岳外史，又号鬻熊后人、火正后人。北宋书法家、画家、书画理论家，与蔡襄、苏轼、黄庭坚合称“宋四家”。曾任校书郎、书画博士、礼部员外郎。祖籍山西，然迁居湖北襄阳，后曾定居润州（今江苏镇江）。能诗文，擅书画，精鉴别，书画自成一家，创立了“米点山水”。米芾集书画家、鉴定家、收藏家于一身。其个性怪异，举止颠狂，遇石称“兄”，膜拜不已，因而人称“米颠”。宋徽宗诏为书画学博士，又称“米襄阳”、“米南宫”。米芾书画自成一家，枯木竹石，山水画独具风格特点。在书法也颇有造诣，擅篆、隶、楷、行、草等书体，长于临摹古人书法，达到乱真程度。' },
                { imgSrc: './img/handwrite/cao/9.jpg', desc: '赵佶《草书千字文》', detail: '赵佶（1082-1135），宋朝第八位皇帝，号宣和主人，宋朝第八位皇帝，书画家。宋神宗第十一子、宋哲宗之弟。先后被封为遂宁王、端王。哲宗于元符三年（1100年）正月病逝时无子，太后向氏于同月立赵佶为帝，次年改年号“建中靖国”。赵佶的艺术主张，强调形神并举，提倡诗、书、画、印结合，他是工笔画的创始人，花鸟、山水、人物、楼阁，无所不画，这便是卓然大家的共同特点。' },
                { imgSrc: './img/handwrite/cao/10.png', desc: '林散之《中日友谊诗》', detail: '林散之（1898.11.20-1989.12.6），名霖，又名以霖，字散之，号三痴、左耳、江上老人等，生于江苏南京市江浦县（今南京市浦口区），祖籍安徽省和县乌江镇七颗松村庄，诗人、书画家，尤擅草书。1972年中日书法交流选拔时一举成名，其书法作品《中日友谊诗》被誉为“林散之第一草书”。赵朴初、启功等称之诗、书、画“当代三绝”，被誉为“草圣”，林散之草书被称之为“林体”。' },
            ],
            ehbtTitle: '史上10大草书书法大家及其作品欣赏'
        }
    }
}

//中国画子内容视图
const person = {
    template: '#subContainerCpn',
    mixins: [hwAndPMixin],
    data() {
        return {
            subImgSrc: './img/paint/person/subImg.jpg',
            subSum: '人物画，是我国传统的画科之一，内容以描绘人物为主。因绘画侧重不同，又可分为人物肖像画和人物故事、风俗画。据记载，人物画在春秋时期已经达到很高水准。从出土的战国楚墓帛画，可以看到当时人物画的成就。人物画一直是中国传统绘画最主要的画科。',
            exhibitions: [
                { imgSrc: './img/paint/person/1.png', desc: '钟进士送妹图 清 孙基瑞', detail: '孙基瑞（1866-?），字守伯，师从钱慧安，工书画，尤擅人物，有钱派人物画遗韵。此扇面绘钟馗嫁妹民间故事。仕女面目是典型的清末开脸，孙守伯学钱吉生，神形俱似，为清末海上画派生力军。' },
                { imgSrc: './img/paint/person/2.png', desc: '王蜀宫妓图立轴 明 唐寅', detail: '伯虎人物画力学南宋刘松年，加以周东村，杜柽狂二家笔法，敷色精雅，立意高标，诚可谓江南第一才子。' },
                { imgSrc: './img/paint/person/3.png', desc: '桐荫清梦图 明 唐寅', detail: '此幅以人物画为题材，抒发画家的生活遭遇和感受。此图用水墨白描手法，画梧桐一株，桐阴坡石处一人仰面闭目，坐於交椅之上，神情生动自然。构图简洁，用笔洗练，风格洒脱，韵致清逸，是唐寅白描人物画佳作。诗、书、画相得益彰。虽未署年款，但从题诗内容可以看出，此图是他在科场案受打击回苏州后所作，是画家看破尘事，不再追求功名，从此幽居林下的写照。' },
                { imgSrc: './img/paint/person/4.png', desc: '携琴探梅图 明 杜堇(传)', detail: '此幅旁题作：宋马远携琴探梅图真迹。然仔细观赏，山石，树木，人物画法与传世杜堇的画作有些内在之联系，可初定为杜堇传派所画。' },
                { imgSrc: './img/paint/person/5.png', desc: '调鹦图 北宋 王居正', detail: '此团扇是存世最重要的数件宋代仕女主题册页之一，画面中人物画法使用早期背粉的画法，但人物以外的画法略显繁琐和粗糙。可能是北宋宣和时期至南宋早期间一位宫廷画家的作品。' },
                { imgSrc: './img/paint/person/6.png', desc: '醉归图 清 袁江', detail: '此画写宫庭歌舞酒宴尽欢而散的情景。宫殿画法工整严谨，界画规整。人物用笔轻松自然，神态刻画入神，应是袁江供奉清内庭时的精品之作。袁文涛以山水楼阁名世，不想人物画也如此功力深厚。 袁江（1662—1735）字文涛，号岫泉。江都（今江苏扬州）人。在清康熙、雍正、乾隆时期，楼阁界画山水当以袁江最有名，当时还有他的侄子袁耀同齐名。擅画山水、楼台、师法宋人。人物师仇英，山水学郭忠恕笔法及赵伯驹、刘松年等青绿山水一脉。' },
                { imgSrc: './img/paint/person/7.png', desc: '松荫醉翁图 明 杜琼（传）', detail: '此幅绘松荫下两高士观云听泉，款杜琼。杜东原人物画稀见，无从比较，故存疑。' },
                { imgSrc: './img/paint/person/8.png', desc: '歌舞图 明 吴伟', detail: '画面绘一群人围着地面上翩翩起舞不过年方10岁，叫李奴奴的小女孩。狎客或侧首细品，或低头凝视，或举目静观，或捻须沉思。陪坐的女妓或机械地执板伴奏，或心不在焉地笼袖而坐。 此图为吴伟45岁时所作' }
            ],
            ehbtTitle: '人物画作品展'
        }
    }
}
const animal = {
    template: '#subContainerCpn',
    mixins: [hwAndPMixin],
    data() {
        return {
            subImgSrc: './img/paint/animal/subImg.jpg',
            subSum: '花鸟画，我国传统绘画画科之一。以描绘花卉、竹石、鸟兽、虫鱼等为画面主体。四五千年以前的陶器上出现的简单鱼鸟图案，可以看作最早的花鸟画。据唐代张彦远《历代名画记》中的记载，东晋和南朝时，画在绢帛上的花画已经逐步形成独立的画科，并且出现一些专门的画家。五代、两宋间，这一画科更趋成熟。',
            exhibitions: [
                { imgSrc: './img/paint/animal/1.png', desc: '红叶小鸟 近现代 谢稚柳', detail: '图绘古枝枯朽，枝头却冒出红叶数片，画面瞬间生气勃勃；高枝上黑灰羽毛鸟儿一只，羽毛整齐发亮，体型娇小修长，眼神敏锐，转头警剔的盯着后方。画左上侧题：若飞先生法教，乙酉冬日谢稚柳渝州。谢椎柳，近现代画家，国画大师，其花鸟画有着陈洪绶风格。' },
                { imgSrc: './img/paint/animal/2.png', desc: '芙蓉锦鸡图 北宋 赵佶', detail: '此图是描绘金秋景色的花鸟画作。图中芙蓉盛开，随风轻轻颤动，蝴蝶翩跹，相互追逐嬉戏，引得落在枝上的锦鸡回首凝视，目不转睛。' },
                { imgSrc: './img/paint/animal/3.png', desc: '榴开见子图 南宋 吴炳', detail: '吴炳，生卒年不详，毗陵武阳（今江苏常州）人，南宋光宗绍熙年间（1190-1194年）任画院待诏，是南宋院体花鸟画的代表性画家。此页描绘石榴因熟透而果皮迸裂，一只柳莺闻香而来；石榴桃红的外皮饱满圆润，里头紫红色的子鲜嫩欲滴、粒粒分明，用以象征多子多孙之意。' },
                { imgSrc: './img/paint/animal/4.png', desc: '红白芙蓉图 南宋 李迪', detail: ' 这两幅折枝花，画面虽小，但细致的线条勾勒、高明度鲜艳的色彩、精致的描绘方式，既妙于生意，又能不失其真，是画家尽其所能而创作的。 此图的韵味若浥露疏风，光色艳发，晔晔灼灼，使人目眩神驰。 这份感觉，也是促使作品高雅的气息所在。' },
                { imgSrc: './img/paint/animal/5.png', desc: '枫鹰雉鸡图 南宋 李迪', detail: '画面作对角线构图，主体禽鸟雄鹰置于左上角枯枝巅，俯首下视，紧盯着右下角的锦雉。雉鸡张口鸣叫，正向草丛中窜逃。斜线的呼应关系和雉鸡奔向画外的动态，营造出强烈的紧张气氛，扣人心弦。' },
                { imgSrc: './img/paint/animal/6.png', desc: '溪凫图轴 元 陈琳', detail: '陈琳，元代画家，字仲美，南宋画院待诏陈珏子。擅画花鸟、山水、人物，得赵孟頫指授，尤擅临摹古迹。一只体硕羽丰的野鸭临水而立，霜晴溪碧，秋意浓郁。其中溪水、汀岸、芙蓉、小草都用笔粗简有致，而鸭子绘法却很工整细致。这幅画反映了元初花鸟画从院体的工细艳丽向以水墨为主要表现手法的文人画过渡的特点。' },
                { imgSrc: './img/paint/animal/7.png', desc: '杨皇后题桃花图 南宋 佚名', detail: '描绘春天到来桃花争春盛开的美艳。一支桃枝主枝从右下斜如画，分成四根分散开，枝枒上，嫩叶吐绿，花朵或盛开，或含苞待放，粉白花瓣朵朵娇艳。' },
                { imgSrc: './img/paint/animal/8.png', desc: '苹婆山鸟图 五代 黄荃（传）', detail: '团扇绘一苹果细枝右侧入画，叶片四周枯黄虫洞甚多，树叶下藏有四颗果子，粉白相间的果皮相当诱人，细枝尽头一只鹦嘴哥翘着尾巴盯着前方，表情俏皮！' },
            ],
            ehbtTitle: '花鸟画作品展'
        }
    }
}
const lanscape = {
    template: '#subContainerCpn',
    mixins: [hwAndPMixin],
    data() {
        return {
            subImgSrc: './img/paint/lanscape/subImg.jpg',
            subSum: '山水画，简称“山水”，中国画画科之一。是以描写山川自然景色为主题的绘画。在魏晋六朝，逐渐发展，但仍多作为人物画的背景；至隋唐，已有不少独立的山水画制作；五代、北宋而益趋成熟，作者纷起，从此成为中国画中的一大画科。主要有青绿、金碧、没骨、浅绛、水墨等形式。在艺术表现上讲求经营位置和表达意境。',
            exhibitions: [
                { imgSrc: './img/paint/lanscape/1.png', desc: '烟树茅堂图 明 董其昌', detail: '此图是玄宰用巨然笔意画的一幅山水画，用笔极清极秀，是董玄宰典型面目。' },
                { imgSrc: './img/paint/lanscape/2.png', desc: '山水图 清 吴昌硕', detail: '吴昌硕很少作山水画，此幅戏笔为之，得笔墨华滋之味，逸品也。' },
                { imgSrc: './img/paint/lanscape/3.png', desc: '赤壁图 元 吴镇', detail: '吴镇笔下的山水画有着江南山水的秀气，水墨清淡，山峰圆润，山中有着氤氲之状，表现出一种苍茫沉郁、古厚纯朴之气' },
                { imgSrc: './img/paint/lanscape/4.png', desc: '观梅图 清 王翚', detail: '此幅绘一高士于山谷空地草亭中观梅听瀑，画境开阔，意境深远，用“董、巨”笔意而能化为己意，是石谷精心绘制的小品山水画。' },
                { imgSrc: './img/paint/lanscape/5.png', desc: '寒林图 北宋 范宽（传）', detail: '宋代山水画家真正得李成荒寒骨气的，最可称范宽、郭熙二人，以致在北宋时形成了以李、范、郭为主的喜画雪景寒林、推崇荒寒画风的潜在绘画流派。此幅更有郭熙画派风格，当是后人临郭之作。' },
                { imgSrc: './img/paint/lanscape/6.png', desc: '西海门图轴 当代 黄宾虹', detail: '此幅图有着画家老年“黑、密、厚、重”的画风，所画山川层层深厚，气势磅礴，惊世骇俗，这一显著特点，也使中国的山水画上升到一种至高无上的境界。黄宾虹与齐白石被尊称“南黄北齐”。' },
                { imgSrc: './img/paint/lanscape/7.png', desc: '山水轴 近现代 朱屺瞻', detail: '纸本，设色，154X83cm，收藏不详。水墨绘山水之景，远山如黛，水天一色；近处巨石绿树覆盖，红叶飘飘，可见帆船数艘掩印于山石之后，河水之上。朱屺瞻，号起哉，近代画家，画坛的一代宗师。' },
                { imgSrc: './img/paint/lanscape/8.png', desc: '山水图 清 佚名', detail: '纸本，淡设色，50X82.9cm，收藏不详。绘远处山峰连绵，云雾飘渺；山谷中数座楼阁依山而建，泉水由山水倾下，在谷中逗留，再向山脚流淌；近处一座简陋的屋旁，一人赤裸上身忙碌，一只白鹤单腿站立，扭头看着那人，人鹤共处，其乐融融。' },
            ],
            ehbtTitle: '山水画作品展'
        }
    }
}

//诗词曲赋子内容
const poetryMixin = {
    mounted() {
        //实现瀑布流
        //获取当前展示作品的个数
        const exhibiLen = this.exhibitions.length;
        //由于router-view有过度动画，上一组作品结点未从dom中移除，故需截取倒数exhibiLen个作品结点，即当前要展示的作品结点
        const allBox = [...document.querySelectorAll('.exhibiContent1')].slice(-exhibiLen);
        // console.log(allBox);
        const titleHeight = this.$refs.exbibiTitle.offsetHeight;
        // console.log(titleHeight);
        const heightArr = [];
        for (let i = 0; i < allBox.length; i++) {
            // console.log(heightArr);
            let boxHeight = allBox[i].offsetHeight;
            if (i < 4) {
                heightArr.push(boxHeight);
                // allBox[i].style.position = 'absolute';
                // allBox[i].style.left = 25 * i + '%';
                // allBox[i].style.top = '0px';
            }
            else {
                let minIndex = -1, minHeight = Infinity;
                heightArr.forEach((item, index) => {
                    if (item < minHeight) {
                        minIndex = index;
                        minHeight = item;
                    }
                });
                allBox[i].style.position = 'absolute';
                allBox[i].style.left = 25 * minIndex + '%';
                allBox[i].style.top = heightArr[minIndex] + titleHeight + 'px';
                heightArr[minIndex] += boxHeight;
            }
        }
        const height = Math.max.apply(this, heightArr);
        this.$refs.exhibition1.style.height = height + 'px';
    },
    computed: {
        split() {
            return function (s) {
                const arr = [];
                let left = 0;
                for (let i = 0; i < s.length; i++) {
                    if (s[i] === '，' || s[i] === '。' || s[i] === '？' ||
                        s[i] === '！' || s[i] === '：' || s[i] === '。' ||
                        s[i] === '；') {
                        arr.push(s.slice(left, i + 1));
                        left = i + 1;
                    }
                }
                return arr;
            }
        }
    },
}
const han = {
    template: '#subContainerCpn1',
    mixins: [poetryMixin],
    data() {
        return {
            subImgSrc: './img/poetry/han/subImg.jpg',
            subSum: '汉赋，是在汉朝涌现出的一种有韵的散文，它的特点是散韵结合，专事铺叙。从赋的形式上看，在于“铺采摛文”；从赋的内容上说，侧重“体物写志”。汉赋的内容可分为5类：一是渲染宫殿城市；二是描写帝王游猎；三是叙述旅行经历；四是抒发不遇之情；五是杂谈禽兽草木。而以前二者为汉赋之代表。赋是汉代最流行的文体。在两汉400年间，一般文人多致力于这种文体的写作，因而盛极一时，后世往往把它看成是汉代文学的代表。',
            exhibitions: [
                { authorInfo: '汉 班固', title: '明堂诗', sentence: '于昭明堂。明堂孔阳。圣皇宗祀。穆穆煌煌。上帝宴飨。五位时序。谁其配之。世祖光武。普天率土。各以其职。猗欤缉熙。允怀多福。' },
                { authorInfo: '汉 刘彻', title: '秋风辞', sentence: '秋风起兮白云飞，草木黄落兮雁南归。兰有秀兮菊有芳，怀佳人兮不能忘。泛楼船兮济汾河，横中流兮扬素波。箫鼓鸣兮发棹歌，欢乐极兮哀情多。' },
                { authorInfo: '汉 秦嘉', title: '述婚诗', sentence: '纷彼婚姻。祸福之由。卫女兴齐。褒姒灭周。战战竞竞。惧德不仇。神启其吉。果获令攸。我之爱矣。荷天之休。' },
                { authorInfo: '汉 宋子侯', title: '董娇娆', sentence: '洛阳城东路，桃李生路旁。花花自相对，叶叶自相当。春风东北起，花叶正低昂。不知谁家子，提笼行采桑。纤手折其枝，花落何飘扬。请谢彼姝子，何为见损伤。高秋八九月，白露变为霜。终年会飘堕，安得久馨香。秋时自零落，春月复芬芳。何如盛年去，欢爱永相忘。吾欲竟此曲，此曲愁人肠。归来酌美酒，挟瑟上高堂。' },
                { authorInfo: '汉 孔融', title: '临终诗', sentence: '言多令事败。器漏苦不密。河溃蚁孔端。山坏由猿穴。涓涓江汉流。天窗通冥室。谗邪害公正。浮云翳白日。靡辞无忠诚。华繁竟不实。人有两三心。安能合为一。三人成市虎。浸渍解胶漆。生存多所虑。长寝万事毕。' },
                { authorInfo: '汉 刘细君', title: '悲秋歌', sentence: '吾家嫁我兮天一方，远托异国兮乌孙王。穹庐为室兮毡为墙，以肉为食兮酪为浆。居常土思兮心内伤，愿为黄鹄兮归故乡。' },
                { authorInfo: '汉 虞姬', title: '和项王歌', sentence: '汉兵已略地，四方楚歌声。大王意气尽，贱妾何聊生！' },
                { authorInfo: '汉 刘邦', title: '大风歌', sentence: '大风起兮云飞扬，威加海内兮归故乡。威加海内兮归故乡。' },
                { authorInfo: '汉 苏武', title: '留别妻', sentence: '结发为夫妻，恩爱两不疑。欢娱在今夕，嬿婉及良时。征夫怀远路，起视夜何其？参辰皆已没，去去从此辞。行役在战场，相见未有期。握手一长叹，泪为生别滋。努力爱春华，莫忘欢乐时。生当复来归，死当长相思。' },
                { authorInfo: '汉 嵇康', title: '琴歌', sentence: '凌扶摇兮憩瀛洲。要列子兮为好仇。餐沆瀣兮带朝霞。眇翩翩兮薄天游。齐万物兮超自得。委性命兮任去留。' },
                { authorInfo: '汉 司马相如', title: '琴歌二首', sentence: '凤兮凤兮归故乡，遨游四海求其皇。时未遇兮无所将，何悟今兮升斯堂！有艳淑女在闺房，室迩人遐毒我肠。何缘交颈为鸳鸯，胡颉颃兮共翱翔！皇兮皇兮从我栖，得托孳尾永为妃。交情通意心和谐，中夜相从知者谁？双翼俱起翻高飞，无感我思使余悲。' },
                { authorInfo: '汉 项羽', title: '垓下歌', sentence: '力拔山兮气盖世。时不利兮骓不逝。骓不逝兮可奈何！虞兮虞兮奈若何！' },
            ],
            exbibiTitle: '汉赋作品赏析'
        }
    },
}
const tang = {
    template: '#subContainerCpn1',
    mixins: [poetryMixin],
    data() {
        return {
            subImgSrc: './img/poetry/tang/subImg.jpg',
            subSum: '唐诗，泛指创作于唐朝诗人的诗，为唐代儒客文人之智慧佳作。唐诗是中华民族珍贵的文化遗产之一，是中华文化宝库中的一颗明珠，同时也对世界上许多国家的文化发展产生了很大影响，对于后人研究唐代的政治、民情、风俗、文化等都有重要的参考意义。',
            exhibitions: [
                { authorInfo: '唐 贾岛', title: '寻隐者不遇', sentence: '松下问童子，言师采药去。只在此山中，云深不知处。' },
                { authorInfo: '唐 徐贤妃', title: '长门怨', sentence: '旧爱柏梁台，新宠昭阳殿。守分辞方辇，含情泣团扇。一朝歌舞荣，夙昔诗书贱。颓恩诚已矣，覆水难重荐。' },
                { authorInfo: '唐 李商隐', title: '无题', sentence: '相见时难别亦难，东风无力百花残。春蚕到死丝方尽，蜡炬成灰泪始干。晓镜但愁云鬓改，夜吟应觉月光寒。蓬山此去无多路，青鸟殷勤为探看。' },
                { authorInfo: '唐 王维', title: '山居秋暝', sentence: '空山新雨后，天气晚来秋。明月松间照，清泉石上流。竹喧归浣女，莲动下渔舟。随意春芳歇，王孙自可留。' },
                { authorInfo: '唐 贺知章', title: '回乡偶书', sentence: '少小离家老大回，乡音无改鬓毛衰。儿童相见不相识，笑问客从何处来。' },
                { authorInfo: '唐 李世民', title: '咏风', sentence: '萧条起关塞，摇飏下蓬瀛。拂林花乱彩，响谷鸟分声。披云罗影散，泛水织文生。劳歌大风曲，威加四海清。' },
                { authorInfo: '唐 狄仁杰', title: '奉和圣制夏日游石淙山', sentence: '宸晖降望金舆转，仙路峥嵘碧涧幽。羽仗遥临鸾鹤驾，帷宫直坐凤麟洲。飞泉洒液恒疑雨，密树含凉镇似秋。老臣预陪悬圃宴，馀年方共赤松游。' },
                { authorInfo: '唐 王昌龄', title: '出塞', sentence: '秦时明月汉时关，万里长征人未还。但使龙城飞将在，不教胡马度阴山。' },
                { authorInfo: '唐 李白', title: '行路难 其一', sentence: '金樽清酒斗十千，玉盘珍羞直万钱。停杯投箸不能食，拔剑四顾心茫然。欲渡黄河冰塞川，将登太行雪满山。闲来垂钓碧溪上，忽复乘舟梦日边。行路难，行路难，多歧路，今安在。长风破浪会有时，直挂云帆济沧海。' },
                { authorInfo: '唐 孟郊', title: '登科后', sentence: '昔日龌龊不足夸，今朝放荡思无涯。春风得意马蹄疾，一日看尽长安花。' },
                { authorInfo: '唐 白居易', title: '忆江南·江南忆', sentence: '江南忆，其次忆吴宫。吴酒一杯春竹叶，吴娃双舞醉芙蓉，早晚复相逢。' },
                { authorInfo: '唐 李煜', title: '相见欢·无言独上西楼', sentence: '无言独上西楼，月如钩。寂寞梧桐深院，锁清秋。剪不断，理还乱，是离愁。别是一般滋味，在心头。' },
                { authorInfo: '唐 柳宗元', title: '江雪', sentence: '千山鸟飞绝，万径人踪灭。孤舟蓑笠翁，独钓寒江雪。' },
                { authorInfo: '唐 杜牧', title: '清明', sentence: '清明时节雨纷纷，路上行人欲断魂。借问酒家何处有，牧童遥指杏花村。' },
                { authorInfo: '唐 崔颢', title: '黄鹤楼', sentence: '昔人已乘黄鹤去，此地空余黄鹤楼。黄鹤一去不复返，白云千载空悠悠。晴川历历汉阳树，芳草萋萋鹦鹉洲。日暮乡关何处是？烟波江上使人愁。' },
                { authorInfo: '唐 刘禹锡', title: '望洞庭', sentence: '湖光秋月两相和，潭面无风镜未磨。遥望洞庭山水翠，白银盘里一青螺。' },
                { authorInfo: '唐 孟浩然', title: '宿建德江', sentence: '移舟泊烟渚，日暮客愁新。野旷天低树，江清月近人。' },
                { authorInfo: '唐 王勃', title: '送杜少府之任蜀州', sentence: '城阙辅三秦，风烟望五津。与君离别意，同是宦游人。海内存知已，天涯若比邻。无为在歧路，儿女共沾巾。' },
                { authorInfo: '唐 杜甫', title: '登高', sentence: '风急天高猿啸哀，渚清沙白鸟飞回。无边落木萧萧下，不尽长江滚滚来。万里悲秋常作客，百年多病独登台。艰难苦恨繁霜鬓，潦倒新停浊酒杯。' },
                { authorInfo: '唐 李贺', title: '雁门太守行', sentence: '黑云压城城欲摧，甲光向日金鳞开。角声满天秋色里，塞上燕脂凝夜紫。半卷红旗临易水，霜重鼓寒声不起。' },
                { authorInfo: '唐 张九龄', title: '赋得自君之出矣', sentence: '自君之出矣，不复理残机。思君如满月，夜夜减清辉。' },
            ],
            exbibiTitle: '唐诗作品赏析'
        }
    }
}
const song = {
    template: '#subContainerCpn1',
    mixins: [poetryMixin],
    data() {
        return {
            subImgSrc: './img/poetry/song/subImg.jpg',
            subSum: '宋代盛行的一种中国文学体裁，宋词是一种相对于古体诗的新体诗歌之一，为宋代儒客文人智慧精华，标志宋代文学的最高成就。宋词句子有长有短，便于歌唱。因是合乐的歌词，故又称曲子词、乐府、乐章、长短句、诗余、琴趣等。它始于南朝梁代，形成于唐代而极盛于宋代。宋词是中国古代文学皇冠上光辉夺目的明珠，在古代中国文学的阆苑里，它是一座芬芳绚丽的园圃。',
            exhibitions: [
                { authorInfo: '宋 范仲淹', title: '渔家傲·秋思', sentence: '塞下秋来风景异，衡阳雁去无留意。四面边声连角起。千嶂里，长烟落日孤城闭。浊酒一杯家万里，燕然未勒归无计，羌管悠悠霜满地。人不寐，将军白发征夫泪。' },
                { authorInfo: '宋 晏殊', title: '浣溪沙', sentence: '一曲新词酒一杯，去年天气旧亭台。夕阳西下几时回？无可奈何花落去，似曾相识燕归来。小园香径独徘徊。' },
                { authorInfo: '宋 苏轼', title: '蝶恋花·春景', sentence: '花褪残红青杏小。燕子飞时，绿水人家绕。枝上柳绵吹又少，天涯何处无芳草。墙里秋千墙外道。墙外行人，墙里佳人笑。笑渐不闻声渐悄，多情却被无情恼。' },
                { authorInfo: '宋 李清照', title: '蝶恋花·暖雨晴风初破冻 ', sentence: '暖雨晴风初破冻，柳眼梅腮，已觉春心动。酒意诗情谁与共？泪融残粉花钿重。乍试夹衫金缕缝，山枕斜欹，枕损钗头凤。独抱浓愁无好梦，夜阑犹剪灯花弄。' },
                { authorInfo: '宋 陈东甫', title: '长相思·花深深 ', sentence: '花深深。柳阴阴。度柳穿花觅信音。君心负妾心。 怨呜琴。恨孤衾。钿誓钗盟何处寻。当初谁料今。' },
                { authorInfo: '宋 陆游', title: '鹊桥仙·华灯纵博', sentence: '华灯纵博，雕鞍驰射，谁记当年豪举。酒徒一半取封侯，独去作、江边渔父。 轻舟八尺，低篷三扇，占断苹洲烟雨。镜湖元自属闲人，又何必、君恩赐与。' },
                { authorInfo: '宋 李清照', title: '武陵春·春晚 ', sentence: '风住尘香花已尽，日晚倦梳头。物是人非事事休，欲语泪先流。 闻说双溪春尚好，也拟泛轻舟。只恐双溪舴艋舟，载不动许多愁。' },
                { authorInfo: '宋 蒋捷', title: '虞美人·听雨', sentence: '少年听雨歌楼上。红烛昏罗帐。壮年听雨客舟中。江阔云低、断雁叫西风。 而今听雨僧庐下。鬓已星星也。悲欢离合总无情。一任阶前、点滴到天明。' },
                { authorInfo: '宋 黄升', title: '清平乐·宫怨 ', sentence: '珠帘寂寂。愁背银缸泣。记得少年初选入。三十六宫第一。 当年掌上承恩。而今冷落长门。又是羊车过也，月明花落黄昏。' },
                { authorInfo: '宋 严蕊', title: '卜算子·不是爱风尘 ', sentence: '不是爱风尘，似被前缘误。花落花开自有时，总赖东君主。去也终须去，住也如何住！若得山花插满头，莫问奴归处。' },
                { authorInfo: '宋 陆游', title: '卜算子·咏梅 ', sentence: '驿外断桥边，寂寞开无主。已是黄昏独自愁，更著风和雨。 无意苦争春，一任群芳妒。零落成泥碾作尘，只有香如故。' },
                { authorInfo: '宋 辛弃疾', title: '菩萨蛮·书江西造口壁 ', sentence: '郁孤台下清江水，中间多少行人泪？西北望长安，可怜无数山。青山遮不住，毕竟东流去。江晚正愁余，山深闻鹧鸪。 ' },
                { authorInfo: '宋 辛弃疾', title: '青玉案·元夕 ', sentence: '东风夜放花千树。更吹落、星如雨。宝马雕车香满路。凤箫声动，玉壶光转，一夜鱼龙舞。 蛾儿雪柳黄金缕。笑语盈盈暗香去。众里寻他千百度。蓦然回首，那人却在，灯火阑珊处。' },
                { authorInfo: '宋 李之仪', title: '卜算子·我住长江头', sentence: '我住长江头，君住长江尾。日日思君不见君，共饮长江水。 此水几时休，此恨何时已。只愿君心似我心，定不负相思意。' },
                { authorInfo: '宋 仲殊', title: '南柯子·十里青山远', sentence: '十里青山远，潮平路带沙。数声啼鸟怨年华。又是凄凉时候，在天涯。白露收残月，清风散晓霞。绿杨堤畔问荷花：记得年时沽酒，那人家？' },
            ],
            exbibiTitle: '宋词作品赏析'
        }
    }
}
const yuan = {
    template: '#subContainerCpn1',
    mixins: [poetryMixin],
    data() {
        return {
            subImgSrc: './img/poetry/yuan/subImg.jpg',
            subSum: '元曲，是盛行于元代的一种文艺形式，为元代儒客文人智慧精髓，包括杂剧和散曲，有时专指杂剧。 杂剧，宋代以滑稽搞笑为特点的一种表演形式，元代发展成戏曲形式。每本以四折为主，在开头或折间另加楔子，每折用同宫调同韵的北曲套曲和宾白组成。如关汉卿的《窦娥冤》等。流行于大都（今北京）一带。明清两代也有杂剧，但每本不限四折。 散曲，盛行于元、明、清三代的没有宾白的曲子形式。内容以抒情为主，有小令和套数两种。',
            exhibitions: [
                { authorInfo: '元 顾德润', title: '醉高歌过摊破喜春来·旅中', sentence: '长江远映青山，回首难穷望眼。扁舟来往蒹葭岸，人憔悴云林又晚。篱边黄菊经霜暗，囊底青蚨逐日悭。破清思晚砧鸣，断愁肠檐马韵，惊客梦晓钟寒。归去难，修一缄，回两字寄平安。' },
                { authorInfo: '元 马致远', title: '天净沙·秋思', sentence: '枯藤老树昏鸦，小桥流水人家，古道西风瘦马。夕阳西下，断肠人在天涯。' },
                { authorInfo: '元 张养浩', title: '山坡羊·潼关怀古', sentence: '峰峦如聚，波涛如怒，山河表里潼关路。望西都，意踌躇。伤心秦汉经行处，宫阙万间都做了土。兴，百姓苦；亡，百姓苦！' },
                { authorInfo: '元 白朴', title: '天净沙·秋', sentence: '孤村落日残霞，轻烟老树寒鸦，一点飞鸿影下。青山绿水，白草红叶黄花。' },
                { authorInfo: '元 张可久', title: '卖花声·怀古', sentence: '阿房舞殿翻罗袖，金谷名园起玉楼，隋堤古柳缆龙舟。不堪回首，东风还又，野花开暮春时候。美人自刎乌江岸，战火曾烧赤壁山，将军空老玉门关。伤心秦汉，生民涂炭，读书人一声长叹。' },
                { authorInfo: '明 王磐', title: '朝天子·咏喇叭', sentence: '喇叭，唢呐，曲儿小腔儿大。官船来往乱如麻，全仗你抬声价。军听了军愁，民听了民怕。哪里去辨甚么真共假？眼见的吹翻了这家，吹伤了那家，只吹的水尽鹅飞罢！' },
                { authorInfo: '元 汤显祖', title: '游园', sentence: '原来姹紫嫣红开遍，似这般都付与断井颓垣。良辰美景奈何天，赏心乐事谁家院！朝飞暮卷，云霞翠轩；雨丝风片，烟波画船——锦屏人忒看的这韶光贱！' },
                { authorInfo: '元 关汉卿', title: '大德歌·春', sentence: '子规啼，不如归，道是春归人未归。几日添憔悴，虚飘飘柳絮飞。一春鱼雁无消息，则见双燕斗衔泥。' },
                { authorInfo: '元 张可久', title: '塞鸿秋·春情', sentence: '疏星淡月秋千院，愁云恨雨芙蓉面。伤情燕足留红线，恼人鸾影闲团扇。兽炉沉水烟，翠沼残花片。一行写入相思传。' },
                { authorInfo: '元 关汉卿', title: '大德歌·冬', sentence: '雪纷纷，掩重门，不由人不断魂，瘦损江梅韵。那里是清江江上村，香闺里冷落谁瞅问？好一个憔悴的凭栏人。' },
            ],
            exbibiTitle: '元曲作品赏析'
        }
    }
}

//传统节日子内容
const festival = {
    template: '#subContainerCpn2',
    data() {
        return {
            fsItems: [
                { imgSrc: './img/festival/1.jpg', link: 'https://baike.baidu.com/item/%E4%B8%AD%E5%9B%BD%E4%BC%A0%E7%BB%9F%E8%8A%82%E6%97%A5/396100#3_1', desc: '春节，即农历新年，是一年之岁首、传统意义上的年节。俗称新春、新年、新岁、岁旦、年禧、大年等，口头上又称度岁、庆岁、过年、过大年。在春节期间，全国各地均有举行各种庆贺新春活动，带有浓郁的各地域特色，热闹喜庆的气氛洋溢；这些活动以除旧布新、驱邪攘灾、拜神祭祖、纳福祈年为主要内容，形式丰富多彩，凝聚着中华传统文化精华。' },
                { imgSrc: './img/festival/2.jpg', link: 'https://baike.baidu.com/item/%E4%B8%AD%E5%9B%BD%E4%BC%A0%E7%BB%9F%E8%8A%82%E6%97%A5/396100#3_2', desc: '元宵节，又称上元节、小正月、元夕或灯节，是中国的传统节日之一，时间为每年农历正月十五。正月是农历的元月，古人称“夜”为“宵”，正月十五是一年中第一个月圆之夜，所以称正月十五为“元宵节”。元宵节主要有赏花灯、吃汤圆、猜灯谜、放烟花等一系列传统民俗活动。' },
                { imgSrc: './img/festival/3.jpg', link: 'https://baike.baidu.com/item/%E4%B8%AD%E5%9B%BD%E4%BC%A0%E7%BB%9F%E8%8A%82%E6%97%A5/396100#3_7', desc: '清明节，又称踏青节、行清节、三月节、祭祖节等，节期在仲春与暮春之交。清明节是传统的重大春祭节日，扫墓祭祀、缅怀祖先，是中华民族自古以来的优良传统，不仅有利于弘扬孝道亲情、唤醒家族共同记忆，还可促进家族成员乃至民族的凝聚力和认同感。' },
                { imgSrc: './img/festival/4.jpg', link: 'https://baike.baidu.com/item/%E4%B8%AD%E5%9B%BD%E4%BC%A0%E7%BB%9F%E8%8A%82%E6%97%A5/396100#3_8', desc: '端午节，又称端阳节、龙舟节、重午节、龙节、正阳节、天中节等，源自天象崇拜，由上古时代祭龙演变而来。其起源涵盖了古老星象文化、人文哲学等方面内容，蕴含着深邃丰厚的文化内涵；在传承发展中杂揉了多种民俗为一体，节俗内容丰富。扒龙舟与食粽是端午节的两大礼俗，这两大礼俗在中国自古传承，至今不辍。' },
                { imgSrc: './img/festival/5.jpg', link: 'https://baike.baidu.com/item/%E4%B8%AD%E5%9B%BD%E4%BC%A0%E7%BB%9F%E8%8A%82%E6%97%A5/396100#3_9', desc: '七夕节，又称七巧节、七姐节、女儿节、乞巧节、七娘会、七夕祭、牛公牛婆日、巧夕等，是中国民间的传统节日。七夕节由星宿崇拜衍化而来，为传统意义上的七姐诞。经历史发展，七夕被赋予了“牛郎织女”的美丽爱情传说，使其成为了象征爱情的节日，从而被认为是中国最具浪漫色彩的传统节日，在当代更是产生了“中国情人节”的文化含义。' },
                { imgSrc: './img/festival/6.jpg', link: 'https://baike.baidu.com/item/%E4%B8%AD%E5%9B%BD%E4%BC%A0%E7%BB%9F%E8%8A%82%E6%97%A5/396100#3_11', desc: '中秋节，又称祭月节、月光诞、月夕、秋节、仲秋节、拜月节、月娘节、月亮节、团圆节等，是中国民间的传统节日。中秋节源自天象崇拜，由上古时代秋夕祭月演变而来。最初“祭月节”的节期是在干支历二十四节气“秋分”这天，后来才调至夏历（农历）八月十五。中秋节自古便有祭月、赏月、吃月饼、玩花灯、赏桂花、饮桂花酒等民俗，流传至今，经久不息。' },
                { imgSrc: './img/festival/7.jpg', link: 'https://baike.baidu.com/item/%E4%B8%AD%E5%9B%BD%E4%BC%A0%E7%BB%9F%E8%8A%82%E6%97%A5/396100#3_17', desc: '除夕，为岁末的最后一天夜晚。岁末的最后一天称为“岁除”，意为旧岁至此而除，另换新岁。除夕，在国人心中是具有特殊意义的，这个年尾最重要的日子，漂泊再远的游子也是要赶着回家去和家人团聚，在爆竹声中辞旧岁，烟花满天迎新春。除夕自古就有祭祖、守岁、团圆饭、贴年红、挂灯笼等习俗，流传至今，经久不息。' },
            ]
        }
    }
}

//路由组
const routes = [
    { path: '/', redirect: '/handwrite' },
    {
        path: '/handwrite',
        components: { default: hwContainer, aside: hwAside },
        // alias: '/',
        children: [
            { path: 'zhuanshu', component: zhuan, alias: '' },
            { path: 'lishu', component: li },
            { path: 'kaishu', component: kai },
            { path: 'xingshu', component: xing },
            { path: 'caoshu', component: cao },
        ],
        meta: ['/handwrite', 'zhuanshu', 'lishu', 'kaishu', 'xingshu', 'caoshu']
    },
    {
        path: '/paint',
        components: { default: paintContainer, aside: paintAside },
        children: [
            { path: 'person', component: person, alias: '' },
            { path: 'animal', component: animal },
            { path: 'lanscape', component: lanscape },
        ],
        meta: ['/paint', 'person', 'animal', 'lanscape']
    },
    {
        path: '/poetry',
        components: { default: poetryContainer, aside: poetryAside },
        children: [
            { path: 'han', component: han, alias: '' },
            { path: 'tang', component: tang },
            { path: 'song', component: song },
            { path: 'yuan', component: yuan },
        ],
        meta: ['/poetry', 'han', 'tang', 'song', 'yuan']
    },
    {
        path: '/festival',
        components: { default: fsContainer, aside: fsAside },
        children: [{ path: '', component: festival }]
    },
]

const router = VueRouter.createRouter({
    history: VueRouter.createWebHashHistory(),
    routes,
})



const app = Vue.createApp({
    data() {
        return {
            gateShow: true,
            homeShow: false,
            navItem: [
                {
                    main: '书法',
                    sub: ['篆书', '隶书', '楷书', '行书', '草书']
                },
                {
                    main: '中国画',
                    sub: ['人物画', '花鸟画', '山水画']
                },
                {
                    main: '诗词曲赋',
                    sub: ['汉赋', '唐诗', '宋词', '元曲']
                },
                { main: '传统节日', sub: [] }
                // '书法', '中国画', '诗词曲赋', '传统节日'
            ],
            curItem: 0,
            curSubItem: 0
        }
    },
    components: {
        gate,
        // home,
    },
    computed: {
        navImgPath() {
            return function (item) {
                return `./img/${item}.png`
            }
        },
        routePath() {
            switch (this.curItem) {
                case 0: return '/handwrite';
                case 1: return '/paint';
                case 2: return '/poetry';
                default: return '/festival';
            }
        },
        firstPath() {
            const arr = this.$route.path.split('/');
            // console.log(arr);
            const res = '/' + arr[1];
            // console.log(res);
            return res;
        },
        subPath() {
            // console.log(this.$route.meta);
            const arr = this.$route.path.split('/');
            // console.log(arr);
            const res = arr[2];
            // console.log(res);
            return res;
        },
        fullPath() {
            return this.$route.path;
        }
    },
    methods: {
        navClick(index) {
            if (index !== this.curItem) {
                this.curItem = index;
                this.curSubItem = 0;
                this.$router.push(this.routePath);
                const a = document.querySelector('article');
                a.scrollTop = 0;
            }
        },
        subClick(index) {
            let path = this.$route.meta[0] + '/' + this.$route.meta[index + 1];
            // console.log(path);
            this.curSubItem = index;
            this.$router.push(path);
            const a = document.querySelector('article');
            a.scrollTop = 0;
        }
    },
    watch: {
        firstPath(val) {
            switch (val) {
                case '/handwrite': this.curItem = 0; break;
                case '/paint': this.curItem = 1; break;
                case '/poetry': this.curItem = 2; break;
                default: this.curItem = 3;
            }
        },
        subPath(val) {
            // console.log(val);
            for (let key in this.$route.meta) {
                if (this.$route.meta[key] === val) {
                    this.curSubItem = key - 1;
                    // console.log(typeof this.curSubItem, this.curSubItem);
                    break;
                }
            }
        },
        fullPath(val) {
            // console.log(val);
            if (val !== '/handwrite' && this.gateShow && !this.homeShow) {
                this.gateShow = false;
                this.homeShow = true;
            }
        }
    }
})

app.use(router)

app.mount('#app')